#!/bin/bash

# 整数の引数


#---------------------------------------------------------------------

# 例: コマンド --number 5

while [[ $# -gt 0 ]] # $#は(未処理の)引数の数
do
  case "$1" in

  -n|--number)
    [[ $2 ]] || { echo "$1には引数が必要"; exit 1; }
    # 自然数の正規表現 ^(0|[1-9][0-9]*)$
    [[ $2 =~ ^(0|[1-9][0-9]*)$ ]] || { echo "エラー: --number: 0以上の自然数: $2"; exit 1; }
    number=$2
    shift 2
    ;;

  # オプションでもその引数でもないもの(オペランド)
  *) # その他なんでもマッチ
    operand[${#operand[@]}]=$1 # 配列に追加
    shift 1
    ;;

  esac
done

# デフォルト
[[ $number ]] || number=1


#---------------------------------------------------------------------

# 自然数の加減乗除は$(( ))の中でできる

if [ $(( $number % 2 )) = 0 ]; then
  # 偶数なら2で割る
  result=$(( number / 2 ))
else
  # 奇数なら3倍して1足す
  result=$(( number * 3 + 1 ))
fi

echo "$number -> $result"

